Autodesk.Revit.DB.GeometryObjectArray
An array that contains geometry objects.

Autodesk.Revit.DB.GeometryObjectArray.Insert(Autodesk.Revit.DB.GeometryObject,System.Int32)
System.Int32
Insert the specified geometry object into the array.
item: The geometry object to be inserted into the array.
index: The geometry object will be inserted before this index.
Returns: Returns whether the geometry object was inserted into the array.

Autodesk.Revit.DB.GeometryObjectArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.GeometryObjectArray.ReverseIterator
Autodesk.Revit.DB.GeometryObjectArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.GeometryObjectArray.ForwardIterator
Autodesk.Revit.DB.GeometryObjectArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.GeometryObjectArray.Append(Autodesk.Revit.DB.GeometryObject)
void
Add the geometry object to the end of the array.
item: The geometry object to be added.

Autodesk.Revit.DB.GeometryObjectArray.Clear
void
Removes every geometry object from the array, rendering it empty.

Autodesk.Revit.DB.GeometryObjectArray.Size
System.Int32
get
Returns the number of geometry objects that are in the array.

Autodesk.Revit.DB.GeometryObjectArray.Item(System.Int32)
System.Object
Gets or sets a geometry object at a specified index within the array.
index: The index of the geometry object to be set or retrieved.
Returns: Returns the geometry object at the specified index.

Autodesk.Revit.DB.GeometryObjectArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.